# St7SetTitle

Sets information entered in the NOTES tab for the Strand7 model Title, Project, Reference or Author.

long St7SetTitle(long uID, long TitleType, char* TitleString)

Input Parameters

uID

Strand7 model file ID.

TitleType

One of tbTitle, tbProject, tbReference or tbAuthor.

TitleString

A string containing the text entered for the entry TitleType.